{
    "adhkar": [
      {
        "id": 1,
        "type": "repentance",
        "arabic": "لَآ إِلٰهَ إِلَّآ أَنْتَ سُبْحَانَكَ إِنِّيْ كُنْتُ مِنَ الظَّالِمِيْنَ",
        "translation": "There is no god worthy of worship except You; You are free from all imperfection. Indeed, I have been of the wrongdoers. (21:87)",
        "transliteration": "Lā ilāha illā Anta subḥānaka innī kuntu mina-ẓ-ẓālimīn.",
        "benefits": "",
        "repetition": 1,
        "repeated_today": 0,
        "time": "morning"
      },
      {
        "id": 2,
        "type": "repentance",
        "arabic": "رَبِّ إِنِّي ظَلَمْتُ نَفْسِي فَاغْفِرْ لِي",
        "translation": "My Lord, I have certainly wronged myself, so forgive me. (28:16)",
        "transliteration": "Rabbi innī ẓalamtu nafsī fa-ghfirlī.",
        "benefits": "",
        "repetition": 1,
        "repeated_today": 0,
        "time": "morning"
      },
      {
        "id": 3,
        "type": "durood",
        "arabic": "اَللّٰهُمَّ صَلِّ عَلَىٰ مُحَمَّدٍ وَّعَلَىٰ اٰلِ مُحَمَّدٍ ، كَمَا صَلَّيْتَ عَلَىٰ إِبْرَاهِيْمَ وَعَلَىٰ اٰلِ إِبْرَاهِيْمَ ، إِنَّكَ حَمِيْدٌ مَّجِيْدٌ ، اَللّٰهُمَّ بَارِكْ عَلَىٰ مُحَمَّدٍ وَّعَلَىٰ اٰلِ مُحَمَّدٍ ، كَمَا بَارَكْتَ عَلَىٰ إِبْرَاهِيْمَ وَعَلَىٰ اٰلِ إِبْرَاهِيْمَ ، إِنَّكَ حَمِيْدٌ مَّجِيْدٌ",
        "translation": "O Allah, honour and have mercy upon Muhammad and the family of Muhammad as You have honoured and had mercy upon Ibrāhīm and the family of Ibrāhīm. Indeed, You are the Most Praiseworthy, the Most Glorious. O Allah, bless Muhammad and the family of Muhammad as You have blessed Ibrāhīm and the family of Ibrāhīm. Indeed, You are the Most Praiseworthy, the Most Glorious.",
        "transliteration": "Allāhumma ṣalli ʿalā Muḥammad wa ʿalā āli Muḥammad, kamā ṣallayta ʿalā Ibrāhīma wa ʿalā āli Ibrāhīm, innaka Ḥamīdu-m-Majīd, Allāhumma bārik ʿalā Muḥammad, wa ʿalā āli Muḥammad, kamā bārakta ʿalā Ibrāhīma wa ʿalā āli Ibrāhīm, innaka Ḥamīdu-m-Majīd.",
        "benefits": "",
        "repetition": 1,
        "repeated_today": 0,
        "time": "morning"
      },
      {
        "id": 4,
        "type": "durood",
        "arabic": "اَللّٰهُمَّ صَلِّ عَلَىٰ مُحَمَّدٍ وَّأَزْوَاجِهِ وَذُرِّيَّتِهِ ، كَمَا صَلَّيْتَ عَلَىٰ اٰلِ إِبْرَاهِيْمَ ، وَبَارِكْ عَلَىٰ مُحَمَّدٍ وَّأَزْوَاجِهِ وَذُرِّيَّتِهِ ، كَمَا بَارَكْتَ عَلَىٰ اٰلِ إِبْرَاهِيْمَ ، إِنَّكَ حَمِيْدٌ مَّجِيْدٌ.",
        "translation": "O Allah, honour and have mercy upon Muhammad, his spouses and his progeny as You have honoured and had mercy on the family of Ibrāhīm. Bless Muhammad, his spouses and his progeny as You have blessed the family of Ibrāhīm. Indeed, You are the Most Praiseworthy, the Most Glorious.",
        "transliteration": "Allāhumma ṣalli ʿalā Muḥammadiw-wa azwājihī wa dhurriy-yatih, kamā ṣallayta ʿalā āli Ibrāhīm, wa bārik ʿalā Muḥammadi-w-wa azwājihī wa dhurriyyatih, kamā bārakta ʿalā āli Ibrāhīm, innaka Ḥamīdu-m-Majīd.",
        "benefits": "Abu Ḥumayd As-Saʿidī narrates that the people asked, “O Messenger of Allah ﷺ! How shall we send salah on you?” The Messenger of Allah ﷺ replied: “Say [the above].” (Bukhārī 3369)",
        "repetition": 1,
        "repeated_today": 0,
        "time": "morning"
      },
      {
        "id": 5,
        "type": "praise",
        "arabic": "لَا إِلٰهَ إِلَّا اللّٰهُ",
        "translation": "There is no Ilah (object of worship) but Allah",
        "transliteration": "Lā ilāha illā-Allāh",
        "benefits": "The Messenger of Allah ﷺ said: “When a servant of Allah utters the words لَا إِلهَ إِلَّا الله sincerely, the doors of Paradise open up for these words until they reach the Throne of Allah, so long as its utterer keeps away from the major sins.” (Tirmidhī)",
        "repetition": 1,
        "repeated_today": 0,
        "time": "morning"
      },
      {
        "id": 6,
        "type": "praise",
        "arabic": "سُبْحَانَ اللَّهِ وَبِحَمْدِهِ",
        "translation": "Glory be to Allah and Praised is He",
        "transliteration": "Subhan'Allahi wabihamdihi",
        "benefits": "Jaabir ibn 'Abdullah reported that the Messenger of Allah (ﷺ) said: “Whoever says 'Subhan'Allahi Al-Adhim wa bihamdihi' (Glory be to Allah, the Magnificent, and with His praise), a date palm tree will be planted for him in Paradise.” (Al-Tirmidhi (3464) and Al-Nasa'i in “Al-Kubra” (10663)",
        "repetition": 1,
        "repeated_today": 0,
        "time": "morning"
      },
      {
        "id": 7,
        "type": "praise",
        "arabic": "سُبْحَانَ اللّٰهِ",
        "translation": "Allah is free from imperfection.",
        "transliteration": "Subḥān-Allāh.",
        "benefits": "",
        "repetition": 1,
        "repeated_today": 0,
        "time": "morning"
      },
      {
        "id": 8,
        "type": "praise",
        "arabic": "ٱلْحَمْدُ لِلَّٰهِ",
        "translation": "All praise belongs to Allah",
        "transliteration": "Alhamdulillah",
        "benefits": "",
        "repetition": 1,
        "repeated_today": 0,
        "time": "morning"
      },    
      {
        "id": 9,
        "type": "praise",
        "arabic": "لاَ إِلَهَ إِلاَّ اللَّهُ وَحْدَهُ لاَ شَرِيكَ لَهُ، لَهُ الْمُلْكُ، وَلَهُ الْحَمْدُ، وَهُوَ عَلَى كُلِّ شَىْءٍ قَدِيرٌ",
        "translation": "None has the right to be worshipped but Allah, the Alone Who has no partners, to Him belongs Dominion and to Him belong all the Praises, and He has power over all things",
        "transliteration": "La ilaha illallahu wahdahu la sharika lahu lahul mulku wa lahul hamdu wa huwa ala kulli shay in qadeer",
        "benefits": "",
        "repetition": 1,
        "repeated_today": 0,
        "time": "morning"
      },
      {
        "id": 10,
        "type": "repentance",
        "arabic": "أَسْتَغْفِرُ ٱللَّٰهَ",
        "translation": "I seek the forgiveness from Allah",
        "transliteration": "Astaghfirullāh",
        "benefits": "Rasulullah (ﷺ) said: The one who seeks forgiveness for Muslim men and women twenty five or twenty six times every day, Allah will count that person among those whose du'a (supplication) is accepted. Through this person's blessings, those on earth will gain sustenance. (Ibn Majah)",
        "repetition": 1,
        "repeated_today": 0,
        "time": "morning"
      },
      {
        "id": 11,
        "type": "praise",
        "arabic": "اَللّٰهُ أَكْبَرُ",
        "translation": "Allah is greater (than anything)",
        "transliteration": "Allāhu akbar.",
        "benefits": "",
        "repetition": 1,
        "repeated_today": 0,
        "time": "morning"
      }
    ]
  }