{
    "benefits_of_dhikr": [
      {
        "text": "ʿAmr b. ʿAbdillah (rahimahullah) said, “On the Day of Judgement, when the veil revealing the rewards of actions is lifted, people will not see any action with greater reward than dhikr. Then, some people will feel regret and say, ‘There was nothing easier for us than doing dhikr.’”"
      },
      {
        "text": "The Messenger of Allah ﷺ said, “No people leave a gathering in which they did not remember Allah, the Almighty, except that it will be as if they are leaving the carcass of a donkey; and it will be a cause of regret for them” (Abu Dawud)."
      },
      {
        "text": "RasulAllah ﷺ said: “The people of Paradise will not regret anything, except for those moments in which they did not remember Allah” (Tabarani)."
      },
      {
        "text": "The Messenger of Allah ﷺ quoting Prophet Yahya (ʿalayhis-salam) said, “I command you to remember Allah. Verily, the parable of that is a man who is being chased by his enemies, until he comes to an impenetrable fortress, where he protects himself from them. In the same way, a servant will not protect himself against Shaytan except by the dhikr of Allah” (Tirmidhi)."
      },
      {
        "text": "Allah (subhanahu wa ta‘ala) says, “And remember Allah abundantly, so that you may be successful” (62:10)."
      },
      {
        "text": "Allah (subhanahu wa ta‘ala) says, “…And the remembrance of Allah is greater…” (29:45)."
      },
      {
        "text": "Allah (subhanahu wa ta‘ala) says, “O you who believe, let not your wealth and your children divert you from the remembrance of Allah. And whoever does that, then those are the losers” (63:9)."
      },
      {
        "text": "The Messenger of Allah ﷺ quoting Prophet Yahya (ʿalayhis-salam) said, “I command you to remember Allah. Verily, the parable of that is a man who is being chased by his enemies, until he comes to an impenetrable fortress, where he protects himself from them. In the same way, a servant will not protect himself against Shaytan except by the dhikr of Allah” (Tirmidhi)."
      },
      {
        "text": "The Prophet ﷺ said, “There is nothing better a person can do to save himself from Allah’s punishment than to remember Him” (Bayhaqi)."
      },
      {
        "text": "Allah (subhanahu wa ta‘ala) says, “Remember Me, and I will remember you…” (2:152)."
      },
      {
        "text": "The Prophet ﷺ said, “Allah says, ‘I am as My slave thinks of Me, and I am with him when he remembers Me. If he remembers Me within himself, I remember him within Myself; and if he remembers Me in a gathering, I remember him in a better gathering; and if he draws one span nearer to Me, I draw one cubit nearer to him; and if he draws one cubit nearer to Me, I draw a distance of two outstretched arms nearer to him; and if he comes to Me walking, I go to him running’” (Bukhari)."
      },
      {
        "text": "The Messenger of Allah ﷺ said, “Shall I not inform you of the best of your deeds, the purest of them with your Master, the highest of them in ranks, (a deed which) is better for you than spending gold and silver; and better for you than meeting your enemy and striking their necks, and they strike your necks?” They replied, “Of course.” He ﷺ said, “The remembrance of Allah” (Tirmidhi)."
      },
      {
        "text": "A man asked the Messenger of Allah ﷺ, “Which warriors are the best?” He ﷺ replied, “Those who remember Allah the most.” The man asked, “Which of those who fast are the best?” He ﷺ replied, “Those who remember Allah the most.” Then the man mentioned salah, zakah and hajj, and each time the Messenger of Allah ﷺ replied, “Those who remember Allah the most.” Abu Bakr (RA) said to Umar (RA), “Those who remember (Allah) have taken all the good,” at which the Messenger of Allah ﷺ remarked, “Yes, indeed!” (Ahmad)"
      },
      {
        "text": "The Prophet ﷺ was once travelling with his Companions, and he said to them, “Keep walking, this is Jumdan (a mountain near Makkah). The Mufarridun have outdone everyone.” They asked, “Who are the Mufarridun?” He ﷺ replied, “The men and women who frequently remember Allah” (Muslim)."
      },
      {
        "text": "One of the Companions asked, “O Messenger of Allah, the laws of Islam have become many for me, so tell me something which I can cling on to.” He ﷺ replied, “Always keep your tongue moist with the remembrance of Allah” (Tirmidhi)."
      },
      {
        "text": "The Messenger of Allah ﷺ said, “When a group of people assemble for the remembrance of Allah, the angels surround them, (Allah’s) mercy envelops them, tranquillity descends upon them and Allah mentions them to those who are near Him” (Muslim)."
      },
      {
        "text": "The Messenger of Allah ﷺ said, “When you pass by the meadows of Paradise, then graze well.” They asked, “What are the meadows of Paradise?” He replied, “The circles of dhikr” (Tirmidhi)."
      },
      {
        "text": "The Messenger of Allah ﷺ said, “No group of people sit together to remember Allah, except that when they stand to leave, it is said to them: Stand up! Allah has certainly forgiven your sins and replaced your bad deeds with good ones” (Tabarani)."
      },
      {
        "text": "The Prophet ﷺ said, “Allah will certainly resurrect some people on the Day of Judgement; their faces will be beaming with light, and they will be on pulpits of pearls. People will envy them. They will be neither Prophets nor martyrs.” A bedouin fell to his knees and said, “O Messenger of Allah, disclose to us who they are.” He ﷺ said, “They are those who love each other for the sake of Allah. They are from different tribes and places. They gather together for the remembrance of Allah, and they remember Him” (Tabarani)."
      },
      {
        "text": "The Messenger of Allah ﷺ came to a gathering of his Companions and asked, “What has made you sit?” They replied, “We are sitting to remember Allah, and to praise Him for guiding us to Islam and blessing us with it.” The Prophet ﷺ asked, “By Allah, is that the only reason?” They replied, “By Allah, we are only sitting for that.” The Prophet ﷺ said, “Indeed, I did not make you swear an oath because I doubted you. Rather, Jibril came to me and informed me that Allah the Almighty is boasting about you to the angels” (Muslim)."
      },
      {
        "text": "The Messenger of Allah ﷺ said, “There are three (people) whose supplication Allah does not reject: the one who remembers Allah frequently, the oppressed person, and the just leader” (Tabarani)."
      },
      {
        "text": "Ibn al-Qayyim (rahimahullah) said, “Indeed Allah has made a means for attaining everything. He has made continuous remembrance (dhikr) the means for love. So, whoever wants the love of Allah, then let him remember Him abundantly.”"
      },
      {
        "text": "Al-Rabiʿ b. Anas (rahimahullah) said, “The sign of the love of Allah is that there is a great deal of remembrance of Him, because if you ever love a thing, you remember it a great deal.”"
      },
      {
        "text": "Allah (subhanahu wa ta‘ala) says, “On that Day you will see believing men and women with their light shining ahead of them and on their right. (They will be told,) ‘Today you have good news of Gardens, under which rivers flow, (for you) to stay in forever. This is the ultimate triumph’” (57:12)."
      },
      {
        "text": "Allah instructed Musa (ʿalayhis-salam), “And establish prayer for My remembrance” (20:14)"
      },
      {
        "text": "ʿA’ishah (RA) said, “The Messenger of Allah ﷺ used to remember Allah at all times” (Muslim)."
      },
      {
        "text": "“And [ask forgiveness of your Lord and repent to Him], and He will allow you to enjoy a good provision.” (Surah Hud, 11:3)"
      },
      {
        "text": "“And O my people, ask forgiveness of your Lord and then repent to Him. He will send [rain from] the sky upon you in showers and increase you in strength [added] to your strength.” (Surah Hud, 11:52)"
      },
      {
        "text": "The Prophet Muhammad (peace be upon him) said, “Give glad tidings to the one who finds a lot of Istighfar in his record.” (Ibn Majah)"
      },
      {
        "text": "“Whoever regularly seeks forgiveness, Allah will relieve him of every worry and make a way out for him from every hardship, and will provide for him from where he could not imagine.” (Abu Dawood, Ibn Majah)"
      },
      {
        "text": "Saying, ‘Seek your Lord’s forgiveness, for He is truly Most Forgiving. He will shower you with abundant rain, supply you with wealth and children, and give you gardens as well as rivers. (71: 10-12)"
      },
      {
        "text": "Abdullah bin Abbas (May Allah be pleased with them) narrates that Rasulullah (Sallallahu Alayhi Wasallam) said: The one who (regularly) says Istighfaar, that is, frequently repent to Allah Ta’aala for sins committed, Allah Azza Wa-Jal will open a path from poverty and difficulties. All sorrow and hardship will be removed, and in its place prosperity and contentment granted. One will receive sustenance from unimagined and unexpected sources."
      },
      {
        "text": "Abu Hurairah (May Allah be pleased with him) said: The Messenger of Allah (ﷺ) said, By the One in Whose Hand my soul is! If you do not commit sins, Allah would replace you with a people who would commit sins and seek forgiveness from Allah; and Allah will certainly forgive them."
      },
      {
        "text": "Dua of Suleyman (PBUH): My Lord, forgive me and grant me a kingdom such as will not belong to anyone after me. Indeed, you are the Bestower. (38:35)"
      },
      {
        "text": "“The one who seeks forgiveness for Muslim males and females from Allah Ta’aala twenty six or twenty five times every day, Allah Ta’ala will count that person among those whose Du’a is accepted, and through the barakah of whom those on earth gain Rizq (sustenance).”"
      }
    ]
  }